{
  "title": "Home Page for Laze Programming Language",
  "description": "Laze is a programming language that has been developed with the goal of making programming easy for everyone. You can start programming right now in your browser, so let's jump into the world of Laze.",
  
  "Try Laze": "Try Laze now!",

  "Laze Features": "Why Laze? : Laze Features",
  "features": {
    "1": {
      "title": "Native Language",
      "description": "Currently, we are developing mainly Japanese language support. But, we will prepare you to program in a variety of languages in the future."
    },
    "2": {
      "title": "Latest Technologies",
      "description": "It is built using WebAssembly, which makes it faster than other languages running on the web. Furthermore, it uses a drawing method called WebGL2.0, which makes it versatile and fast!"
    },
    "3": {
      "title": "Wherever you are",
      "description": "You can start right now, right in your browser. Everything you need for Laze is right there in the Playground. You don't need to go through the hassle of setting up your own environment anymore."
    }
  },

  "Laze Production": "What can you do with Laze?",
  "productions": {
    "1": {
      "title": "2D Games",
      "description": "Using the standard library, 2D drawing can be done with very simple code."
    },

    "2": {
      "title": "3D Games",
      "description": "It uses WebGL, which means that it can perform as well in 3D as it does in 2D. It comes with a standard library to make it easy to get started."
    },
    "3": {
      "title": "GUI apps (in preparation)",
      "description": "You will be able to easily create GUI applications as good as GUI using HTML and CSS. (In preparation)"
    }
  },
  
  "Join Laze": "Join Laze!",
  "activities": {
    "1": {
      "title": "Read the documentation",
      "description": "Read the Laze documentation. It is available online for free and anyone can read it.",
      "action": "Laze Documentation"
    },
    "2": {
      "title": "Join the community",
      "description": "Ask and answer questions in the community, and make the community more active. The revitalization of the community will lead to the revitalization of the language itself.",
      "action": "Laze Community"
    },
    "3": {
      "title": "Contribute to Laze",
      "description": "There are many things you can do, such as writing the standard Laze library, reporting bugs, suggesting improvements, etc. Laze is still a developing language, so let's make it better with your hands.",
      "action": "GitHub Repository of Laze"
    }
  }
}
